---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams
source: html/e5bd2059-9102-0c1c-e9d4-16a015a4cb5e.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams

Defines common set of parameters for structural analysis.

## Syntax (C#)
```csharp
public class StructuralSectionAnalysisParams : IDisposable
```